#!/usr/bin/env python
# -*- coding: utf-8 -*-


class Product(object):
    def __init__(self, id, title, price, rating, desc, categories):
        self.id = id
        self.title = title
        self.price = price
        self.rating = rating
        self.desc = desc
        self.categories = categories


class Comment(object):
    def __init__(self, id, productId, timestamp, user, rating, content):
        self.id = id
        self.productId = productId
        self.timestamp = timestamp
        self.user = user
        self.rating = rating
        self.content = content



products = [
    Product(1, "第一个商品", 20.3, 4.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["电子商品", "儿童食品"]),
    Product(2, "第二个商品", 30.64, 2.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["儿童食品", "日用百货"]),
    Product(3, "第三个商品", 40.4, 1.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["电子商品", "日用百货"]),
    Product(4, "第四个商品", 50.47, 3.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["电子商品", "日用百货"]),
    Product(5, "第四个商品", 60.34, 4.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["电子商品", "儿童食品"]),
    Product(6, "第五个商品", 70.34, 2.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["电子商品", "日用百货"]),
    Product(7, "第五个商品", 80.4, 3.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["儿童食品", "日用百货"]),
    Product(8, "第六个商品", 90.34, 4.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["电子商品", "儿童食品"]),
    Product(9, "第一个商品", 120.4, 1.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["电子商品", "日用百货"]),
    Product(10, "第一个商品", 420.34, 3.5, "这是一个商品，就是一个商品，为什么是一个商品？我不知道。", ["儿童食品", "日用百货"]),
]

comments = [
    Comment(1, 1, "2018-12-12 12:20:40", "张三", 1, "商品不错，下次还会光顾的."),
    Comment(2, 1, "2018-12-12 12:20:40", "张三", 2, "商品不错，下次还会光顾的."),
    Comment(3, 2, "2018-12-12 12:20:40", "张三", 3, "商品不错，下次还会光顾的."),
    Comment(4, 2, "2018-12-12 12:20:40", "张三", 4, "商品不错，下次还会光顾的."),
    Comment(5, 3, "2018-12-12 12:20:40", "张三", 5, "商品不错，下次还会光顾的."),
    Comment(6, 3, "2018-12-12 12:20:40", "张三", 1, "商品不错，下次还会光顾的."),
    Comment(7, 4, "2018-12-12 12:20:40", "张三", 2, "商品不错，下次还会光顾的."),
]
